init.org
# -*- mode: org; coding: utf-8; -*-
#+TITLE: Psimacs Emacs configuration
#+DESCRIPTION: Loading Emacs configuration using org-babel
#+TAGS: Emacs
#+CATEGORIES: editing
#+STARTUP: showeverything
#+OPTIONS: toc:4 h:4
# #+SETUPFILE: site-lisp/org-html-themes/org/theme-readtheorg.setup
# #+SETUPFILE: site-lisp/org-html-themes/org/theme-bigblow.setup
# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+HTML_HEAD: <link rel="stylesheet" href="http://dakrone.github.io/org.css" type="text/css" />

* Introduction
This is *Psimacs*, a /modern/ *Emacs* configuration build from the ground up using a [[https://de.wikipedia.org/wiki/Literate_programming][literate programming]] technique.
The complete configuration [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][Elisp]] code is embedded into a single [[https://orgmode.org/][org-mode]] file. This is the file that your are
currently reading.

Additionally, *Psimacs* allows the synchronization of the user's local *Emacs* configuration with a configuration
repository residing on [[https://www.dropbox.com/][Dropbox]]. This comes quite handy if sharing of one configuration with multiple machines is
desired.

This document not only describes the *Psimacs* configuration, but also some additional information useful
for working with *Emacs* in general. In this respect it serves as a kind of mind map for the author.

** Motivation

A lot of *Emacs* configurations can be found on the Internet. Many of them are well crafted and could be used out of
the box. Especially, the great *Emacs* distributions like [[https://www.spacemacs.org/][Spacemacs]], [[https://github.com/hlissner/doom-emacs][Doom-Emacs]] and [[https://github.com/seagle0128/.emacs.d][Centaur-Emacs]] are worth giving a try.
But I wanted to craft my own configuration that is tailored to my needs and that allowed me to learn more about the
vast *Emacs* universe. My configuration it not perfect for everyone and it will not be able to compete against the big
frameworks that are build by a lot of talented people. So feel free to use it or blame it. I am fine with it.

The name *Psimacs* is arbitrarily. I was in search for a catchy name with just one syllable in front of the *macs*.

** Installation

This configuration uses *Emacs* >= 27. Clone the git repository into your *.emcas.d* directory

#+BEGIN_EXAMPLE
mv ~/.emacs.d ~/.emacs.d.bak
git clone https://github.com/hatlafax/psimacs.git ~/.emacs.d
#+END_EXAMPLE

and just run *Emacs*.

The only file really needed is the =early-init.el= file. On startup, it reads the file =init.org= and extracts all the
initialization code into the main =init.el= and various additionally =config/init-*.el= files. The created =init.el=
file is then read and evaluated in the further startup procedure. The =init.el= file loads the other =config/init-*.el=
files on evaluation.

Never edit transient file =init.el= or =config/init-*.el= directly. They will be overridden by the next run of
*Psimacs*. Instead modify the =init.org= file to change your configuration.

You can create a HTML document =init.html= of this file by simply typing =C-c C-e h h= in the *Emacs* buffer for
this file. It is recommended to use this =init.html= for browser reading.

** Usage

All functions and variables that are defined in *Psimacs* are prefixed by a path like string  =psimacs/category=.
The /category/ is used to order the functions and variables by topic. For example the /string/ related function
/starts-with/ is defined as =psimacs/string/starts-with=.

** Dependencies

The configuration does have some dependencies that should be installed separately and beforehand of *Psimacs*.
On default the non *Emacs* dependencies are expected to be installed into directory *c:/utils/* on /Windows OS/.
A directory constant =psimacs/config/dependencies-dir= will be defined by the configuration that allows to change
the default location of the dependencies.

** Disclaimer

This is an *Emacs* beginners configuration and the usage is at one's own risk. It is not tested thoroughly. Please
bear in mind.

Many of the configuration settings are borrowed from other similar endeavors out there.

This is work in progress. Sometimes this *Readme* is ahead of times or not yet updated.

** Limitations / Known Issues

- Tested on Windows operating system only

** License (GPL v3)

Copyright (C) 2020-2021 Johannes Brunen (hatlafax@gmx.de)

License: GNU GENERAL PUBLIC LICENSE Version 3, 29 June 2007

This program is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

This program is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with this program.  If not, see <http://www.gnu.org/licenses/>.

* Working with Org-Mode
** Embedding code
[[https://orgmode.org/][Org-mode]] allows embedding of source code blocks into =.org=-files and evaluating them by [[https://orgmode.org/worg/org-contrib/babel/][babel]] a core feature build
into [[https://orgmode.org/manual/Working-with-Source-Code.html][org]]. The [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][Elisp]] code is embedded into special code blocks:

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :tangle no
<BODY>
#+END_SRC
#+END_EXAMPLE

Code block with =:tangle yes= or with =:tangle filename= are part of the configuration. However, any code block
can be deactivated, i.e. omitted from the configuration, by using =:tangle no= in the
block declaration.

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :tangle no
(message "this should never be seen in the Message buffer!")
#+END_SRC
#+END_EXAMPLE

Additionally, a whole section can also be deactivated by a /CANCELED/ or a /DISABLED/ item, e.g.:

*** CANCELED Avoid generating /Emacs Lisp/ code per section

The following [[https://www.gnu.org/software/emacs/manual/html_node/elisp/][Elisp]] block should therefore also not be part of the generated =.el= file although the =:tangle yes=
attribute was used.

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :tangle yes
(message "this should not be seen in the Message buffer!")
#+END_SRC
#+END_EXAMPLE

** Debugging the configuration

Loading of the configuration can always be halted on spot by entering and activating the following source code block
which will enter enter the debugger on execution.

#+BEGIN_EXAMPLE
#+BEGIN_SRC emacs-lisp :tangle no
(debug)
#+END_SRC
#+END_EXAMPLE

