init.org
* Keybinding
I am trying to setup keybinding in a /mnemonics/ way so it's easy to remember (and use).
I am staying with the /standard/ emacs keybinding as much as possible.

*Emacs*'s keybindings has well-defined conventions listed at [[https://www.gnu.org/software/emacs/manual/html%5Fnode/elisp/Key-Binding-Conventions.html][Emacs Key Bindings Convention]].
In summary, the general rules are:
- =C-x= reserved for Emacs native essential keybindings: buffer, window, frame, file, directory, etc.
- =F5= ... =F9= without modifier keys are reserved for users to define.
- =C-c=
    - =C-c C-letter=, =C-c digit= are reserved for major modes.
    - =C-c punctuation= with punctuation in { } < > : ; are also reserved for major modes.
    - =C-c punctuation= with any other punctuation are allocated for minor modes.
    - =C-c letter= are reserved for users.
- Don't rebind =C-g=, =C-h= and =ESC=.

Worth readings about *Emacs* keybindings are [[https://karl-voit.at/2018/07/08/emacs-key-bindings/][UOMF: My Emacs Key Binding Strategy]], [[https://www.masteringemacs.org/article/mastering-key-bindings-emacs][Mastering Key Bindings in Emacs]] and
[[http://www.wilfred.me.uk/blog/2018/01/06/the-emacs-guru-guide-to-key-bindings/][The Emacs Guru Guide to Key Bindings]].

* Early initialization

Starting with *Emacs* 27, an early-init.el file can be used to do early configuration and optimization.
For more information read [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Starting-Up.html#Starting-Up][Starting Up Emacs]] and [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Init-File.html][The Init File]].

#+BEGIN_QUOTE
Emacs can now be configured using an early init file. The file is called early-init.el, in user-emacs-directory.
It is loaded very early in the startup process: before graphical elements such as the tool bar are initialized,
and before the package manager is initialized. The primary purpose is to allow customizing how the package
system is initialized given that initialization now happens before loading the regular init file (see below).

We recommend against putting any customizations in this file that don't need to be set up before initializing
installed add-on packages, because the early init file is read too early into the startup process, and some
important parts of the Emacs session, such as 'window-system' and other GUI features, are not yet set up,
which could make some customization fail to work.
#+END_QUOTE

*Psimacs* uses the =early-init.el= for three purposes. At first, the evaluation of this file tangles the =init.org= file's
embedded elips source code into the corresponding elips files. Especially, the =early-init.el= file is itself
updated on this way, as it is also described in the =init.org= file. Crazy isn't is :-). Secondly, the =early-init.el=
is responsible for synchronizing with a *Psimacs* /dropbox/ repository. This is quite useful when working with multiple
machines and sharing the very same *Emacs* environment. Thirdly, the primary duty of the =early-init.el= file is to
optimize the *Emacs* startup procedure.

As mentioned above, the elisp source of this section is tangled directly into the =early-init.el= file. Since the
tangling happens at startup time on evaluation of the =early-init.el= file, the =early-init.el= might overwritten
itself at startup.

** Preamble

#+BEGIN_SRC emacs-lisp :tangle early-init.el :var file-description="Early initialization"
;;; Commentary:
;;
;; Emacs 27 introduces early-init.el, which is run before init.el,
;; before package and UI initialization happens.
;;
#+END_SRC

** Some basic constants

*** Tangle anything at startup

*Psimacs* allows the tangling of the configuration source code at startup time. The following flag allows to suppresses
this feature completely.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Tangling procedure constants.
;;
(defconst psimacs/config/tangle-anything t
  "If this flag is nil no code is generated by the startup.
This flag allows to only use the 'init-*.el' files of the framework.")
#+END_SRC

*** Tangle early-init.el at startup

*Psimacs* allows the tangling of the =early-init.el= file itself at startup. The following flag suppresses
this feature.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(defconst psimacs/config/tangle-early-init-file t
  "If this flag is t the 'early-init.el' file is generated at startup.
If nil, only the 'early-init.el' file is omitted from the code generation process.")
#+END_SRC

*** Synchronize with Dropbox at startup

*Psimacs* allows the synchronization of files and folders with a /Dropbox/ repository at startup time.
The following flag allows inhibition of this feature.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Synchronization procedure constants.
;;
(defconst psimacs/config/synchronize-at-startup t
  "If this flag is t the 'early-init.el' file synchronizes the configuration with Dropbox.
The local configuration can be synchronized with a mirror configuration on Dropbox. This
allows sharing of a single configuration on multiple machines.")
#+END_SRC

*** Some size numbers

Huge byte sizes are conveniently written in /Mega Bytes/ or even in /Giga Bytes/ by *Psimacs*. Therefore we define
some size constants early.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Conveniency byte size constants
;;
(defconst   1MB (* 1024 1024))
(defconst  20MB (*  20 1MB))
(defconst  30MB (*  30 1MB))
(defconst  50MB (*  50 1MB))
(defconst  64MB (*  64 1MB))
(defconst 128MB (* 128 1MB))
#+END_SRC

*** Primary initalization files and directories

The primary initialization files and directories must be known by the initialization process early in time in order
to allow the =early-init.el= to full fill its duty. These files are evaluated and/or synchronized with a possible
/dropbox/ repository.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Primary Psimacs file and directory constants use for tangling and synchronization
;;
(defconst psimacs/config/main-org-file "init.org"
  "The psimacs initialization file.")

(defconst psimacs/config/icon-file "psi.ico"
  "The psimacs icon file.")

(defconst psimacs/config/license-file "LICENSE"
  "The psimacs license file.")

(defconst psimacs/config/custom-file "custom.el"
  "The psimacs custom elips file.")

(defconst psimacs/config/agenda-dir "agenda"
  "The psimacs agenda directory.")

(defconst psimacs/config/latex-dir "latex"
  "The psimacs latex directory.")

(defconst psimacs/config/assets-dir "assets"
  "The psimacs assets directory.")
 #+END_SRC

*** Copyright and author information

Copyright information that should be inserted into all tangled code.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(defconst psimacs/config/copyright/year       "2020-2021")
(defconst psimacs/config/copyright/author     "Johannes Brunen")
(defconst psimacs/config/copyright/pseudonyme "hatlafax")
(defconst psimacs/config/copyright/email      "hatlafax@gmx.de")
(defconst psimacs/config/copyright/url        "https://github.com/hatlafax/psimacs")
(defconst psimacs/config/copyright/license    "GNU GENERAL PUBLIC LICENSE")
(defconst psimacs/config/copyright/version    "Version 3, 29 June 2007")
 #+END_SRC

*** Garbage collection

Fine tuning the garbage collection after startup initialization.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(defconst psimacs/config/gc-cons-threshold 64MB
  "The default value to use for 'gc-cons-threshold'.
If you experience freezing, decrease this. If you experience stuttering,
increase this.")

(defconst psimacs/config/gc-cons-percentage 0.1
  "This variable specifies the amount of consing before garbage collection occurs.
It is the fraction of the current heap size."
)
#+END_SRC

