early-init.el
(defconst psimacs/config/tangle-anything t
  "If this flag is nil no code is generated by the startup.
This flag allows to only use the 'init-*.el' files of the framework.")

(defconst psimacs/config/tangle-early-init-file t
  "If this flag is t the 'early-init.el' file is generated at startup.
If nil, only the 'early-init.el' file is omitted from the code generation process.")

;;
;; Synchronization procedure constants.
;;
(defconst psimacs/config/synchronize-at-startup t
  "If this flag is t the 'early-init.el' file synchronizes the configuration with Dropbox.
The local configuration can be synchronized with a mirror configuration on Dropbox. This
allows sharing of a single configuration on multiple machines.")

;;
;; Conveniency byte size constants
;;
(defconst   1MB (* 1024 1024))
(defconst   4MB (*   4 1MB))
(defconst  20MB (*  20 1MB))
(defconst  30MB (*  30 1MB))
(defconst  50MB (*  50 1MB))
(defconst  64MB (*  64 1MB))
(defconst 128MB (* 128 1MB))

;;
;; Primary Psimacs file and directory constants use for tangling and synchronization
;;
(defconst psimacs/config/main-org-file "init.org"
  "The psimacs initialization file.")

(defconst psimacs/config/main-html-file "init.html"
  "The psimacs htmlized initialization file.")

(defconst psimacs/config/icon-file "psi.ico"
  "The psimacs icon file.")

(defconst psimacs/config/license-file "LICENSE"
  "The psimacs license file.")

(defconst psimacs/config/custom-file "custom.el"
  "The psimacs custom elips file.")

(defconst psimacs/config/agenda-dir "agenda"
  "The psimacs agenda directory.")

(defconst psimacs/config/latex-dir "latex"
  "The psimacs latex directory.")

(defconst psimacs/config/assets-dir "assets"
  "The psimacs assets directory.")

(defconst psimacs/config/copyright/year       "2020-2021")
(defconst psimacs/config/copyright/author     "Johannes Brunen")
(defconst psimacs/config/copyright/pseudonyme "hatlafax")
(defconst psimacs/config/copyright/email      "hatlafax@gmx.de")
(defconst psimacs/config/copyright/url        "https://github.com/hatlafax/psimacs")
(defconst psimacs/config/copyright/license    "GNU GENERAL PUBLIC LICENSE")
(defconst psimacs/config/copyright/version    "Version 3, 29 June 2007")

;;
;; Psimacs default garbage collection parameters
;;
(defconst psimacs/config/gc-cons-threshold 64MB
  "The default value to use for 'gc-cons-threshold'.
If you experience freezing, decrease this. If you experience stuttering,
increase this.")

(defconst psimacs/config/gc-cons-percentage 0.1
  "This variable specifies the amount of consing before garbage collection occurs.
It is the fraction of the current heap size."
)

;;
