init.org
** Some early optimization settings

- Lexical Scope and binding

  [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Lexical-Binding.html][Lexical Binding]] is condensed to the following quote:

#+BEGIN_QUOTE
  A lexically-bound variable has /lexical scope/, meaning that any reference to the variable must be located
  textually within the binding construct.
#+END_QUOTE

  Its usage is explained in the [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Using-Lexical-Binding.html][Emacs manual]].

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Use lexical binding instead of dynamic binding.
;;
(setq-default lexical-binding t)
#+END_SRC

-  Before *Emacs* 27, the init file was responsible for initializing the package manager by calling
  =package-initialize=. *Emacs* 27 changed the default behavior: It now calls =package-initialize= before loading the
  init file. Since we use the =straight= package manager in *Psimacs*, we inhibit the package manager initialization
  at all.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Inhibit the package manager at all
;;
(setq package-enable-at-startup nil)
#+END_SRC

- Let's inhibit resizing the frame at early stage.

  [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Implied-Frame-Resizing.html][Implied Frame Resizing]]:
#+BEGIN_QUOTE
  By default, Emacs tries to keep the number of lines and columns of a frame's text area unaltered when, for example,
  toggling its menu or tool bar, changing its default font or setting the width of any of its scroll bars. This means
  that in such case Emacs must ask the window manager to resize the frame's window in order to accommodate the size
  change.

  Occasionally, such implied frame resizing may be unwanted, for example, when a frame has been maximized or made
  full-screen (where it's turned off by default). In general, users can disable implied resizing with the following
  option:
#+END_QUOTE

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; If this option is nil, changing a frame' font, menu bar, tool bar, internal borders,
;; fringes or scroll bars may resize its outer frame in order to keep the number of
;; columns or lines of its text area unaltered. If this option is t, no such resizing
;; is done.
;;
(setq frame-inhibit-implied-resize t)
#+END_SRC

- Never use the menu-bar, the tool-bar or the scroll-bar:

  It will be faster to disable them here before they've been initialized.

  *Psimacs* does disable these features by default because these items make Emacs really beautiful on every platform.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Beautify Emacs
;;
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
(horizontal-scroll-bar-mode -1)
#+END_SRC

- Avoid flickering of the screen

  Set theme colors early. The colors are taken from the alect-colors found in the 'alect-themes.el'.
  If another theme is used on default, these settings should be adapted, accordingly.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Change color to avoid screen flickering
;;
(when (display-graphic-p)
  (set-face-background 'default "#4f4f4f" nil)
  (set-face-foreground 'default "#f0dfaf" nil)
)
#+END_SRC

- Avoid garbage collection at startup

  For detail information read the [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Garbage-Collection.html][Garbage Collection manual entry]].

  Later in the initialization process the garbage collection procedure is even more fine tuned.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Garbage collection optimization
;;
(setq gc-cons-threshold  most-positive-fixnum
      ;; The value of this variable is the number of bytes of storage that must
      ;; be allocated for Lisp objects after one garbage collection in order to
      ;; trigger another garbage collection.

      gc-cons-percentage 0.6
      ;; The value of this variable specifies the amount of consing before a
      ;; garbage collection occurs, as a fraction of the current heap size.
)


;;
;; After initialization set the garbage collection threshold to a reasonable value.
;;
(add-hook 'add-init-hook
          `(lambda ()
            (setq gc-cons-threshold  psimacs/config/gc-cons-threshold
                  gc-cons-percentage psimacs/config/gc-cons-percentage)
            (garbage-collect)
                  ) t)
#+END_SRC


- Another small optimization concerns on =file-name-handler-alist=

  On every .el and .elc file loaded during start up, it has to runs those regexps against the filename;
  setting it to nil and after initialization finished put the value back make the initialization process quicker.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(defvar psimacs/config/file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;;
;; After initialization reset the file-name-handler-alist
;;
(add-hook 'emacs-startup-hook
          (lambda ()
            (setq file-name-handler-alist psimacs/config/file-name-handler-alist)
            (makunbound 'psimacs/config/file-name-handler-alist)
            ))
#+END_SRC

- Disable warnings generated when functions are redefined with defadvice

  Defines what to do with redefinitions during Advice de/activation.
  Redefinition occurs if a previously activated function that already has an
  original definition associated with it gets redefined and then de/activated.
  In such a case we can either accept the current definition as the new
  original definition, discard the current definition and replace it with the
  old original, or keep it and raise an error. The values `accept', `discard',
  `error' or `warn' govern what will be done. `warn' is just like `accept' but
  it additionally prints a warning message. All other values will be
  interpreted as `error'.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Suppressing ad-handle-definition warnings
;;
(setq ad-redefinition-action 'accept)
#+END_SRC


- Debugging on error and message buffer limit

#+BEGIN_SRC emacs-lisp :tangle early-init.el
(setq debug-on-error  t                 ; That will open the debugger when the error is raised.
      message-log-max t                 ; Specifies how many lines to keep in the *Messages* buffer.
                                        ; The value t means there is no limit on how many lines to keep.
)
#+END_SRC

** Preamble for any =.el= file

Any generated initialization file should start with the same preamble concerning author, license etc.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Preamble support
;;
(defun psimacs/config/generate-preamble (file org-file description)
  "Generate a proper preamble string for the given file.
FILE        : el file that get generated
ORG-FILE    : org mode file that is prints
DESCRIPTION : short description text"
  (let (
        (preamble (concat (format ";;; %s ---%s-*- lexical-binding: t -*-\n" (file-name-nondirectory file) description)
                                  ";;\n"
                          (format ";; Don't edit this file, edit %s instead ...\n" (file-name-nondirectory org-file))
                                  ";;\n"
                                  "\n"
                          (format ";; Copyright (C) %s %s (%s)\n"
                                  psimacs/config/copyright/year
                                  psimacs/config/copyright/author
                                  psimacs/config/copyright/pseudonyme)
                                  "\n"
                          (format ";; Author:  %s <%s>\n"
                                  psimacs/config/copyright/author
                                  psimacs/config/copyright/email)
                          (format ";; URL:     %s\n" psimacs/config/copyright/url)
                          (format ";; License: %s %s\n"
                                  psimacs/config/copyright/license
                                  psimacs/config/copyright/version)
                                  "\n"
                                  ";; This file is not part of GNU Emacs.\n"
                                  ";;\n"
                                  ";; This program is free software; you can redistribute it and/or\n"
                          (format ";; modify it under the terms of the %s\n"
                                  psimacs/config/copyright/license)
                          (format ";; %s published by the Free Software Foundation.\n" psimacs/config/copyright/version)
                                  ";;\n"
                                  ";; This program is distributed in the hope that it will be useful,\n"
                                  ";; but WITHOUT ANY WARRANTY; without even the implied warranty of\n"
                                  ";; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n"
                                  ";; General Public License for more details.\n"
                                  ";;\n"
                                  ";; You should have received a copy of the GNU General Public License\n"
                                  ";; along with this program; see the file LICENSE.  If not, write to\n"
                                  ";; the Free Software Foundation, Inc., 51 Franklin Street, Fifth\n"
                                  ";; Floor, Boston, MA 02110-1301, USA.\n"
                                  ";;\n"
                                  "\n")))
    preamble
  )
)
#+END_SRC

