init.org
** Execution of the Dropbox synchronization

This starts the synchronization between the user *Psimacs* configuration and the Dropbox configuration repository.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Synchronize with dropbox
;;
(when psimacs/config/synchronize-at-startup
  (psimacs/config/sync-with-dropbox))
#+END_SRC

** Tangling the main =init.org= file.

This starts the processing of this org file (=init.org=), resulting in the final configuration files for *Psimacs*.

#+BEGIN_SRC emacs-lisp :tangle early-init.el
;;
;; Extract elisp code from org files if necessary and load that code into
;; emacs.
;;
(psimacs/config/load-configuration-file (expand-file-name (concat user-emacs-directory
                                                                  psimacs/config/main-org-file)))
#+END_SRC

* Preamble to the =init.el= file

Until this point, all *Psimacs* source code tangled to the =early-inti.el= file. From now on, the actual configuration
file is setup. It starts with a commentary preamble written to the primary =init.el= file.

#+BEGIN_SRC emacs-lisp :tangle yes
;;; Commentary:
;;
;; Emacs 27 introduces early-init.el, which is run before init.el,
;; before package and UI initialization happens.
;;
#+END_SRC

*Psimacs* splits the configuration into various =init-*.el=-files. This will allow better looking up specific
settings or perform some experimentation. Each of these configuration files will be properly documented and it
is possible to completely relinquish the tangling process and work with the =init-*.el = initialization files
alone.

The main configuration starts now. It is sectioned into different topics. Each topic starts with a prime section
of its own.

* System helpers

This has to be provided early in the initialization process so that it is available for the subsequent code.

** System constants flags

The following boolean constants are defined for convenience.

#+BEGIN_SRC emacs-lisp :tangle config/init-config-helper.el :var file-description="Configuration helper"
;;
;; System constants for convenience
;;
(defconst psimacs/system/is-gui-flag        (display-graphic-p)          "Are we running on a GUI Emacs?")
(defconst psimacs/system/is-windows-nt-flag (eq system-type 'windows-nt) "Are we running on a Windows OS system?")
(defconst psimacs/system/is-gnu-linux-flag  (eq system-type 'gnu/linux)  "Are we running on a GNU/Linux system?")
(defconst psimacs/system/is-darwin-flag     (eq system-type 'darwin)     "Are we running on a MAC system?")
#+END_SRC

** Helper functions for assembling folders and files

Some functions to ease the code.

#+BEGIN_SRC emacs-lisp :tangle config/init-config-helper.el
;;
;; Helper functions for file and directory handling
;;
(defun psimacs/file-system/concat-directory (dir subdir)
  "Assemble directory and subdirectory to a new directory."
  (expand-file-name (file-name-as-directory (concat (file-name-as-directory dir) subdir)))
)

(defun psimacs/file-system/concat-file (dir file)
  "Assemble directory and file."
  (expand-file-name (concat (file-name-as-directory dir) file))
)

(defun psimacs/file-system/prefer-dropbox-directory (dir)
  "Evaluates either to the local or to the dropbox pendant directory.
This functions always prefers DIR on dropbox."
  (let ((local-dir (psimacs/file-system/concat-directory user-emacs-directory dir))
        (dropbox-dir (if psimacs/config/synchronize-at-startup
                         psimacs/config/dropbox-emacs-dir
                       nil))
        )
    (if dropbox-dir
        (psimacs/file-system/concat-directory dropbox-dir dir)
      local-dir)))
#+END_SRC

* Configuration constants

In the following various *Psimacs* configuration constants are defined. They are just defined at a central place, but
used only later in the configuration. This section is rather boring. However, I decided to concentrate
all these settings together so that it is easy to lookup or change them.

** Primary directory constants

This defines the =site-lisp= directory for storing local elisp code and the dependencies directory where non *Emacs*
programs are installed.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el :var file-description="Configuration constants"
;;
;; Directory constants used by Psimacs
;;
(defconst psimacs/config/site-lisp-dir
  (psimacs/file-system/concat-directory user-emacs-directory "site-lisp")
  "The psimacs personal site-lisp directory.")

(defconst psimacs/config/session-dir
  (psimacs/file-system/concat-directory user-emacs-directory "session")
  "The psimacs session directory used for storing various session information.")
#+END_SRC

** Tools directory

The tools directory contains non *Emacs* / *Lisp* tools, that are not readily available, but are important for
*Psimacs* configuration. For instance =msys64= is needed by *Psimacs* but an appropriate installation can be provided
by resources from the web. Therefore =msys64= is not found in tools. Goal is it that the =psimacs/config/tools-dir=
is empty.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Installation of 'personal' tools
;;
(defconst psimacs/config/tools-dir
  (psimacs/file-system/concat-directory psimacs/config/site-lisp-dir "tools")
  "The psimac personal tools directory.")
#+END_SRC

** System resources directory

Many dependencies exists to external programs that are used by *Psimacs*. On default most of them are expected
to be installed in the =psimacs/config/system-utils-dir=. For each tool that *Psimacs* expects a detailed installation
recipe is provided.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Installation of system wide utilities and resources
;;
(defconst psimacs/config/system-utils-dir
  (expand-file-name (file-name-as-directory "c:/utils"))
  "The psimac system resources and utility directory.")
#+END_SRC

** Backup constants

*Psimacs* supports the creation of backup files.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Constants used by Psimacs for backups
;;
(defconst psimacs/config/backup-root-dir
  (psimacs/file-system/concat-directory psimacs/config/session-dir "backups")
  "The psimacs backup root directory.")

(defconst psimacs/config/backup-dir
  (psimacs/file-system/concat-directory psimacs/config/backup-root-dir "computer")
  "The psimacs backup directory.")

(defconst psimacs/config/backup-max-number-files 36
  "The psimacs maximal number of tracked backup files.")
#+END_SRC

** Auto saving

Auto saving is performed by *Psimacs* a lot.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Constants used by Psimacs for auto saving
;;
(defconst psimacs/config/auto-save-dir
  (psimacs/file-system/concat-directory psimacs/config/session-dir "auto-save")
  "The psimacs auto save directory.")
#+END_SRC

** Bookmarking

*Psimacs* uses the [[https://github.com/joodland/bm][Visible bookmarks in buffer (bm)]] for bookmarking.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Constants used by Psimacs for bookmarking
;;
(defconst psimacs/config/bookmarks-dir
  (psimacs/file-system/concat-directory psimacs/config/session-dir "bm")
  "The psimacs bookmarks directory.")

(defconst psimacs/config/bm-bookmarks-file
  (psimacs/file-system/concat-file psimacs/config/bookmarks-dir ".bm-bookmarks")
  "The psimacs bm bookmarks file.")
#+END_SRC

** Emacs client/server

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html][Client/Server]] support for *Psimacs*. We use the default /server/ directory. Since we allow multiple
*Emacs* configurations side by side, we must either set the global environment variable =EMACS_SERVER_FILE=
to the correct server file, or we must call *emacsclient* with option =-f server-file=.

*Psimacs* handles that in the following way:
- *Psimacs* uses the =EMACS_SERVER_FILE=
- If at startup a =EMACS_SERVER_FILE= if already defined in the environment and it does not correspond to
  the current configuration, =EMACS_SERVER_FILE= is not modified and the //*Emacs server*/ is not started.
- If the =EMACS_SERVER_FILE= is not defined, or it points to a non existing file, it is set to the
  current configuration's /server-file/ in the user environment.
  Additionally, a =kill-emacs-hook= is set up that removes the environment variable on exit of the *Emacs* session.

References:
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html][Using Emacs as a Server]]
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/TCP-Emacs-server.html#TCP-Emacs-server][TCP Emacs server]]
- [[https://www.gnu.org/software/emacs/manual/html_node/emacs/emacsclient-Options.html][*emacsclient* Options]]

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Constants used by Psimacs for client/server storage
;;
(defconst psimacs/config/server-dir
  (psimacs/file-system/concat-directory user-emacs-directory "server")
  "The psimacs server directory.")

(defconst psimacs/config/server-file
  (psimacs/file-system/concat-file psimacs/config/server-dir "server")
  "The psimacs server file.")


;;
;; ToDo: this should go to the server setup code below
;;
(defvar psimacs/config/found-server-file
   (getenv "EMACS_SERVER_FILE")
   "The active server file.")

(when (and psimacs/system/is-windows-nt-flag
            (or (not psimacs/config/found-server-file)
                (not (file-exists-p psimacs/config/found-server-file))
                (equal psimacs/config/found-server-file psimacs/config/server-file)))
   (start-process "SETX" nil "setx" "EMACS_SERVER_FILE" psimacs/config/server-file)
   (add-hook 'kill-emacs-hook
             (lambda ()
               (call-process "reg.exe" nil nil nil "delete" "HKCU\\Environment" "/v" "EMACS_SERVER_FILE" "/f"))))
#+END_SRC

** Agenda files

Quoting [[http://cachestocaches.com/2016/9/my-workflow-org-agenda/][My Workflow with Org-Agenda]]:
#+BEGIN_QUOTE
The agenda view scans your =.org= files (set by customizing the org-agenda-files variable) and collects all of the
headings with a TODO (or related) keyword. Without the agenda view, keeping track of projects, which I ensure are
top-level TODO items, is difficult. The agenda provides a convenient way of tracking your projects and managing
your calendar.
#+END_QUOTE


#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Org-Agenda directory
;;
(defconst psimacs/config/org-agenda-dir
    (psimacs/file-system/prefer-dropbox-directory "agenda")
    "The psimacs org agenda  directory.")

;;
;; Diary files
;;
(defcustom psimacs/config/org-capture-coding-diary-file "CodingDiary.org"
    "The diary file for capturing coding points.")

(defcustom psimacs/config/org-capture-coding-diary-files
    '(
        "CodingDiary.org"
        "ShadowProject.org"
    )
    "The list of supported diary files for capturing coding points.")
#+END_SRC

** Recent files

Constants that relate to recent file management.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Recent file constants
;;
(defconst psimacs/config/recent-file
    (psimacs/file-system/concat-file psimacs/config/session-dir ".recentf")
    "The psimacs recent file.")
#+END_SRC

** History

Configuration constants for saving the history.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Save history management
;;
(defconst psimacs/config/history-file
    (psimacs/file-system/concat-file psimacs/config/session-dir ".history")
    "The psimacs history file.")
#+END_SRC

** Save-Places
Save place allows store the current cursor position for the next session.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Save cursor positions for the next session
;;
(defconst psimacs/config/save-places-file
    (psimacs/file-system/concat-file psimacs/config/session-dir ".save-places")
    "The psimacs save places file.")
#+END_SRC

** The custom.el file.

The =custom.el= file contains customizations by the user. This file is not synchronized with the /Dropbox/
repository.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; The custom.el file. This file gets not be synchronized
;;
(defconst psimacs/config/custom-file
    (psimacs/file-system/concat-file user-emacs-directory ".custom.el")
    "The psimacs customization file.")
#+END_SRC

** Latex file sharing

LaTeX bibliography should be shared.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; LaTeX file sharing
;;
(defconst psimacs/config/latex-share-dir
  (psimacs/file-system/prefer-dropbox-directory "latex")
  "The psimacs shared latex directory.")
#+END_SRC

** The Amx file

[[https://github.com/DarwinAwardWinner/amx][Amx]] is an alternative interface for M-x in Emacs.

#+BEGIN_SRC emacs-lisp :tangle config/init-constants.el
;;
;; Amx package support file
;;
(defconst psimacs/config/amx-file
  (psimacs/file-system/concat-file psimacs/config/session-dir ".amxf")
  "The psimacs amx file.")
#+END_SRC

** MSYS2

*Psimacs* uses a lot of external programs provided by the [[https://www.msys2.org/][MSYS2]] framework.  [[https://www.msys2.org/][MSYS2]] is a collection of tools and
libraries providing you with an easy-to-use environment for building, installing and running native Windows software.

Download the [[https://www.msys2.org/#installation][installer]] for the [[https://www.msys2.org/][MSYS2]] framework and follow the installation instructions. Install into folder
=c:/utils/msys64= which is the default for *Psimacs*. The installation does not need to be entered in the system path
environment. *Psimacs* handles a proper executable path internally. After finishing the base installation some packages
must be installed with the [[https://www.msys2.org/][MSYS2]] package manager /pacman/. For that, open the =MSYS2 MinGW 64-bit= terminal and execute
the following commands:
