early-init.el
(when psimacs/config/synchronize-at-startup
  (psimacs/config/sync-with-dropbox))

;;
;; Extract elisp code from org files if necessary and load that code into
;; emacs.
;;
(psimacs/config/load-configuration-file (expand-file-name (concat user-emacs-directory
                                                                  psimacs/config/main-org-file)))

